system/controlDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    location        "system";
    class           dictionary;
    object          controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     olaDyMFlow;

startFrom       latestTime;

startTime       0.0;

stopAt          endTime;

endTime         15;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

compression     off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.3;
maxAlphaCo	    0.3;

maxDeltaT       0.01;

functions
{
    probes
    {
        type            probes;
        functionObjectLibs ("libsampling.so");
        enabled         true;
        outputControl   timeStep;
        outputInterval  1;

        fields          // 샘플링할 필드
        (
            p_rgh
        );

        probeLocations
        (
            (-160 0 -1900)    // Probe1 위치: - (1.2 + 0.4)
            (-120 0 -1900)    // Probe2 위치: - 1.2
            (240 0 -1900)    // Probe2 위치: - 1.2

        );
    }
}


// ************************************************************************* //
