system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

X0    -3000;
X1     3000;
Y0     -1000;
Y1     1000;
Z0  -2000;
Z1     200;
// 1000 2000 2200 100 200 220


nx  150;
ny  50;
nz  55;
//150 50 55 30 10 11

vertices
(
    ($X0 $Y0 $Z0)
    ($X1 $Y0 $Z0)
    ($X1 $Y1 $Z0)
    ($X0 $Y1 $Z0)
    ($X0 $Y0 $Z1)
    ($X1 $Y0 $Z1)
    ($X1 $Y1 $Z1)
    ($X0 $Y1 $Z1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nx $ny $nz) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            /*(0 4 6 2)
            (4 8 10 6)*/
            (0  4    7  3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            /*(1 3 7 5)
            (5 7 11 9)*/
            (2  6    5  1)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            /*(0 2 3 1)*/
            (0  3   2   1)
        );
    }
    wall1
    {
        type wall;
        faces
        (
            /*(0 1 5 4)
            (4 5 9 8)*/
            (1  5    4  0)
        );
    }
    wall2
    {
        type wall;
        faces
        (
            /*(2 6 7 3)
            (6 10 11 7)*/
            (3  7    6  2)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            /*(8 9 11 10)*/
            (4  5    6  7)
        );
    }
);

mergePatchPairs
(
);

